app/views/pages/home.html.erb

SELECT COUNT(*) FROM "users"
---
      <br />
       there are <%=User.count %> users