app/controllers/recepcionists_controller.rb

SELECT "recepcionists".* FROM "recepcionists"
---
  def index
    @recepcionists = Recepcionist.all

INSERT INTO "recepcionists" ("nome", "created_at", "updated_at", "sobrenome", "nascimento") VALUES (?, ?, ?, ?, ?)  [["nome", "Jake"], ["created_at", "2023-03-21 21:33:56.307933"], ["updated_at", "2023-03-21 21:33:56.307933"], ["sobrenome", nil], ["nascimento", nil]]
---
  def create
    @recepcionist = Recepcionist.new(recepcionist_params)

    respond_to do |format|
      if @recepcionist.save

SELECT "recepcionists".* FROM "recepcionists" WHERE "recepcionists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_recepcionist
      @recepcionist = Recepcionist.find(params[:id])